Ran Plan for dir: `resources` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform Landscape: a parsing error occured. Falling back to original Terraform output...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.atlantis-s3-read: Refreshing state...
data.aws_iam_policy_document.default_ec2_assume_role: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.test_policy will be created
  + resource "aws_iam_policy" "test_policy" {
      + arn         = (known after apply)
      + description = "test policy for atlantis"
      + id          = (known after apply)
      + name        = "atlantis-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::test9/*",
                          + "arn:aws:s3:::test9",
                          + "arn:aws:s3:::test8/*",
                          + "arn:aws:s3:::test8",
                          + "arn:aws:s3:::test7/*",
                          + "arn:aws:s3:::test7",
                          + "arn:aws:s3:::test6/*",
                          + "arn:aws:s3:::test6",
                          + "arn:aws:s3:::test5/*",
                          + "arn:aws:s3:::test5",
                          + "arn:aws:s3:::test4/*",
                          + "arn:aws:s3:::test4",
                          + "arn:aws:s3:::test3/*",
                          + "arn:aws:s3:::test3",
                          + "arn:aws:s3:::test20/*",
                          + "arn:aws:s3:::test20",
                          + "arn:aws:s3:::test2/*",
                          + "arn:aws:s3:::test2",
                          + "arn:aws:s3:::test19/*",
                          + "arn:aws:s3:::test19",
                          + "arn:aws:s3:::test18/*",
                          + "arn:aws:s3:::test18",
                          + "arn:aws:s3:::test17/*",
                          + "arn:aws:s3:::test17",
                          + "arn:aws:s3:::test16/*",
                          + "arn:aws:s3:::test16",
                          + "arn:aws:s3:::test1/*",
                          + "arn:aws:s3:::test1",
                        ]
                      + Sid      = "1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.test_atlantis will be created
  + resource "aws_iam_role" "test_atlantis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.atlantis_policy_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "atlantis_policy_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "atlantis-role"
    }

  # null_resource.test_resource will be created
  + resource "null_resource" "test_resource" {
      + id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /Users/apurv/.atlantis/repos/Apurv11/test_atlantis/5/default/resources/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/apurv/.atlantis/repos/Apurv11/test_atlantis/5/default/resources/default.tfplan"


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d resources`
* :put_litter_in_its_place: To **delete** this plan click [here](https://b75e-2405-201-ac01-c214-3d5f-24a8-2153-e522.in.ngrok.io/lock?id=Apurv11%252Ftest_atlantis%252Fresources%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d resources`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
